# BendFinalLoopOrientationVector Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricSheet..::..BendFinalLoopOrientationVector Property
FabricSheet Class See Also
---
Direction of local Fabric Sheet Y axis in bending polyline LCS.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public XYZ BendFinalLoopOrientationVector { get; }
```

Visual Basic
---
```text
Public ReadOnly Property BendFinalLoopOrientationVector As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ BendFinalLoopOrientationVector {
	XYZ^ get ();
}
```

# Remarks
Note that bending line may be rotated before it is placed in Fabric Sheet local coordinate system. This vector allows to calculate rotation angle or Trf.
# See Also
FabricSheet Class
Autodesk.Revit.DB.Structure Namespace